IsTemplate Property
 Test whether the view is a view template.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public bool IsTemplate { get; }
  Visual Basic
Public ReadOnly Property IsTemplate As Boolean
	Get
  Visual C++
public:
property bool IsTemplate {
	bool get ();
}
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →